In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv('train_ctrUa4K.csv')
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

# Handling Nan value

In [3]:
df.isna().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [5]:
df.Gender.describe()

count      601
unique       2
top       Male
freq       489
Name: Gender, dtype: object

In [6]:
df.Married.describe()

count     611
unique      2
top       Yes
freq      398
Name: Married, dtype: object

In [7]:
df.Dependents.describe()

count     599
unique      4
top         0
freq      345
Name: Dependents, dtype: object

In [9]:
df.Self_Employed.describe()

count     582
unique      2
top        No
freq      500
Name: Self_Employed, dtype: object

In [10]:
df.LoanAmount.describe()

count    592.000000
mean     146.412162
std       85.587325
min        9.000000
25%      100.000000
50%      128.000000
75%      168.000000
max      700.000000
Name: LoanAmount, dtype: float64

In [11]:
df.Loan_Amount_Term.describe()

count    600.00000
mean     342.00000
std       65.12041
min       12.00000
25%      360.00000
50%      360.00000
75%      360.00000
max      480.00000
Name: Loan_Amount_Term, dtype: float64

In [12]:
df.Gender.fillna("Male",inplace=True)
df.Married.fillna("Yes",inplace=True)
df.Dependents.interpolate(method='pad',inplace=True)
df.Self_Employed.fillna("No",inplace=True)
df.LoanAmount.fillna(146.412162,inplace=True)
df.Loan_Amount_Term.fillna(342.00000,inplace=True)

In [13]:
df.isna().sum()

Loan_ID               0
Gender                0
Married               0
Dependents            0
Education             0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term      0
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

#Credit_History have large amount of nan planning to drop this column

# Data Normalisation

In [14]:
df.ApplicantIncome=(df.ApplicantIncome-df.ApplicantIncome.mean())/(df.ApplicantIncome.max()-df.ApplicantIncome.min())
df.CoapplicantIncome=(df.CoapplicantIncome-df.CoapplicantIncome.mean())/(df.CoapplicantIncome.max()-df.CoapplicantIncome.min())
df.LoanAmount=(df.LoanAmount-df.LoanAmount.mean())/(df.LoanAmount.max()-df.LoanAmount.min())
df.Loan_Amount_Term=(df.Loan_Amount_Term-df.Loan_Amount_Term.mean())/(df.Loan_Amount_Term.max()-df.Loan_Amount_Term.min())

In [15]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,0.005511,-0.038910,-2.262688e-10,0.038462,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,-0.010148,-0.002718,-2.664568e-02,0.038462,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,-0.029727,-0.038910,-1.163707e-01,0.038462,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,-0.034885,0.017682,-3.822310e-02,0.038462,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,0.007378,-0.038910,-7.832362e-03,0.038462,1.0,Urban,Y

# Handling Categorical data
##Gender,Married,Dependents are nominal data and Education,Self-Employed,Property area ordinal data

In [52]:
categories1 = pd.Categorical(df['Education'], categories=['Not Graduate', 'Graduate'], ordered=True)
labels1, unique1 = pd.factorize(categories1, sort=True)
df['Eduacation-e'] = labels1
categories2 = pd.Categorical(df['Property_Area'], categories=['Rural', 'Semiurban','Urban'], ordered=True)
labels2, unique2 = pd.factorize(categories2, sort=True)
df['Property_Area-e'] = labels2
categories3 = pd.Categorical(df['Gender'], categories=['Female', 'Male','Urban'], ordered=True)
labels3, unique3 = pd.factorize(categories3, sort=True)
df['Gender-e'] = labels3
categories4 = pd.Categorical(df['Dependents'], categories=['0', '1', '2', '3+'], ordered=True)
labels4, unique4 = pd.factorize(categories4, sort=True)
df['Dependents-e'] = labels4
categories5 = pd.Categorical(df['Self_Employed'], categories=['Yes','No'], ordered=True)
labels5, unique5 = pd.factorize(categories5, sort=True)
df['Self_Employed-e'] = labels5
categories6 = pd.Categorical(df['Loan_Status'], categories=['N','Y'], ordered=True)
labels6, unique6 = pd.factorize(categories6, sort=True)
df['Loan_Status-e'] = labels6

In [53]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Eduacation-e,Property_Area-e,Gender-e,Dependents-e,Self_Employed-e,Loan_Status-e
0,LP001002,Male,No,0,Graduate,No,0.005511,-0.038910,-2.262688e-10,0.038462,1.0,Urban,Y,1,2,1,0,1,1
1,LP001003,Male,Yes,1,Graduate,No,-0.010148,-0.002718,-2.664568e-02,0.038462,1.0,Rural,N,1,0,1,1,1,0
2,LP001005,Male,Yes,0,Graduate,Yes,-0.029727,-0.038910,-1.163707e-01,0.038462,1.0,Urban,Y,1,2,1,0,0,1
3,LP001006,Male,Yes,0,Not Graduate,No,-0.034885,0.017682,-3.822310e-02,0.038462,1.0,Urban,Y,0,2,1,0,1,1
4,LP001008,Male,No,0,Graduate,No,0.007378,-0.038910,-7.832362e-03,0.038462,1.0,Urban,Y,1,2,1,0,1,1

# Converting continuous data to discrete bins

In [54]:
df1=df[['ApplicantIncome','CoapplicantIncome','LoanAmount','Loan_Amount_Term']]

In [55]:
from sklearn.preprocessing import KBinsDiscretizer
kbins = KBinsDiscretizer(n_bins=[5,5,5,3], encode='ordinal', strategy='uniform').fit(df1)
df2=kbins.transform(df1)
df2.astype('object')
df21=pd.DataFrame(data=df2,columns=('ApplicantIncome','CoapplicantIncome','LoanAmount','Loan_Amount_Term'))
df21

     ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term
0                0.0                0.0         0.0               2.0
1                0.0                0.0         0.0               2.0
2                0.0                0.0         0.0               2.0
3                0.0                0.0         0.0               2.0
4                0.0                0.0         0.0               2.0
..               ...                ...         ...               ...
609              0.0                0.0         0.0               2.0
610              0.0                0.0         0.0               1.0
611              0.0                0.0         1.0               2.0
612              0.0                0.0         1.0               2.0
613              0.0                0.0         0.0               2.0

[614 rows x 4 columns]

# Concate data frame

In [56]:
df11=df[['Gender-e','Dependents-e','Eduacation-e','Self_Employed-e']]

In [57]:
X=pd.concat([df21,df11], axis=1).astype(int)
X.head()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Gender-e,Dependents-e,Eduacation-e,Self_Employed-e
0,0,0,0,2,1,0,1,1
1,0,0,0,2,1,1,1,1
2,0,0,0,2,1,0,1,0
3,0,0,0,2,1,0,0,1
4,0,0,0,2,1,0,1,1

In [58]:
Y=df[['Loan_Status-e']]
Y.head()

   Loan_Status-e
0              1
1              0
2              1
3              1
4              1

# Import test data and hypertune as test data

In [59]:
dft=pd.read_csv('test_lAUu6dG.csv')
dft.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

In [60]:
dft.isna().sum()

Loan_ID               0
Gender               11
Married               0
Dependents           10
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            5
Loan_Amount_Term      6
Credit_History       29
Property_Area         0
dtype: int64

In [61]:
dft.Gender.describe()

count      356
unique       2
top       Male
freq       286
Name: Gender, dtype: object

In [62]:
dft.Dependents.describe()

count     357
unique      4
top         0
freq      200
Name: Dependents, dtype: object

In [63]:
dft.Self_Employed.describe()

count     344
unique      2
top        No
freq      307
Name: Self_Employed, dtype: object

In [64]:
dft.LoanAmount.describe()

count    362.000000
mean     136.132597
std       61.366652
min       28.000000
25%      100.250000
50%      125.000000
75%      158.000000
max      550.000000
Name: LoanAmount, dtype: float64

In [65]:
dft.Loan_Amount_Term.describe()

count    361.000000
mean     342.537396
std       65.156643
min        6.000000
25%      360.000000
50%      360.000000
75%      360.000000
max      480.000000
Name: Loan_Amount_Term, dtype: float64

In [66]:
dft.Gender.fillna("Male",inplace=True)
dft.Dependents.interpolate(method='pad',inplace=True)
dft.Self_Employed.fillna("No",inplace=True)
dft.LoanAmount.fillna(136.132597,inplace=True)
dft.Loan_Amount_Term.fillna(342.537396,inplace=True)

In [67]:
dft.isna().sum()

Loan_ID               0
Gender                0
Married               0
Dependents            0
Education             0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term      0
Credit_History       29
Property_Area         0
dtype: int64

In [68]:
dft.ApplicantIncome=(dft.ApplicantIncome-dft.ApplicantIncome.mean())/(dft.ApplicantIncome.max()-dft.ApplicantIncome.min())
dft.CoapplicantIncome=(dft.CoapplicantIncome-dft.CoapplicantIncome.mean())/(dft.CoapplicantIncome.max()-dft.CoapplicantIncome.min())
dft.LoanAmount=(dft.LoanAmount-dft.LoanAmount.mean())/(dft.LoanAmount.max()-dft.LoanAmount.min())
dft.Loan_Amount_Term=(dft.Loan_Amount_Term-dft.Loan_Amount_Term.mean())/(dft.Loan_Amount_Term.max()-dft.Loan_Amount_Term.min())

In [69]:
dft1=dft[['ApplicantIncome','CoapplicantIncome','LoanAmount','Loan_Amount_Term']]

In [70]:
categoriest1 = pd.Categorical(dft['Education'], categories=['Not Graduate', 'Graduate'], ordered=True)
labelst1, uniquet1 = pd.factorize(categoriest1, sort=True)
dft['Eduacation-e'] = labelst1
categoriest2 = pd.Categorical(dft['Property_Area'], categories=['Rural', 'Semiurban','Urban'], ordered=True)
labelst2, uniquet2 = pd.factorize(categoriest2, sort=True)
df['Property_Area-e'] = labels2
categoriest3 = pd.Categorical(dft['Gender'], categories=['Female', 'Male','Urban'], ordered=True)
labelst3, uniquet3 = pd.factorize(categoriest3, sort=True)
dft['Gender-e'] = labelst3
categoriest4 = pd.Categorical(dft['Dependents'], categories=['0', '1', '2', '3+'], ordered=True)
labelst4, uniquet4 = pd.factorize(categoriest4, sort=True)
dft['Dependents-e'] = labelst4
categoriest5 = pd.Categorical(dft['Self_Employed'], categories=['Yes','No'], ordered=True)
labelst5, uniquet5 = pd.factorize(categoriest5, sort=True)
dft['Self_Employed-e'] = labelst5

In [80]:
dft11=dft[['Gender-e','Dependents-e','Eduacation-e','Self_Employed-e']]
dft11.isna().sum()

Gender-e           0
Dependents-e       0
Eduacation-e       0
Self_Employed-e    0
dtype: int64

In [86]:
kbinst = KBinsDiscretizer(n_bins=[5,5,5,3], encode='ordinal', strategy='uniform').fit(dft1)
dft2=kbinst.transform(dft1)
dft2.astype('object')
dft21=pd.DataFrame(data=dft2,columns=('ApplicantIncome','CoapplicantIncome','LoanAmount','Loan_Amount_Term'))
dft21

     ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term
0                0.0                0.0         0.0               2.0
1                0.0                0.0         0.0               2.0
2                0.0                0.0         1.0               2.0
3                0.0                0.0         0.0               2.0
4                0.0                0.0         0.0               2.0
..               ...                ...         ...               ...
362              0.0                0.0         0.0               2.0
363              0.0                0.0         0.0               2.0
364              0.0                0.0         0.0               2.0
365              0.0                0.0         1.0               2.0
366              0.0                0.0         0.0               1.0

[367 rows x 4 columns]

In [87]:
dft21.isna().sum()

ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
dtype: int64

In [93]:
Xt=pd.concat([dft21,dft11], axis=1).astype(int)
Xt.columns

Index(['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Gender-e', 'Dependents-e', 'Eduacation-e',
       'Self_Employed-e'],
      dtype='object')

In [94]:
X.columns

Index(['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Gender-e', 'Dependents-e', 'Eduacation-e',
       'Self_Employed-e'],
      dtype='object')

In [95]:
from sklearn.ensemble import RandomForestClassifier
clf=RandomForestClassifier(n_estimators=500)
clf.fit(X,Y)
y_pred=clf.predict(Xt)

C:\Users\lenovo\anaconda3\lib\site-packages\ipykernel_launcher.py:3: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  This is separate from the ipykernel package so we can avoid doing imports until

In [98]:
np.savetxt('predict_rndfrst.csv',y_pred)

In [108]:
import xgboost as xgb
xgb_model = xgb.XGBClassifier(objective="binary:logistic", random_state=42)

In [109]:
xgb_model.fit(X, Y)
y_predxg = xgb_model.predict(Xt)

C:\Users\lenovo\anaconda3\lib\site-packages\sklearn\preprocessing\_label.py:235: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
C:\Users\lenovo\anaconda3\lib\site-packages\sklearn\preprocessing\_label.py:268: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [110]:
np.savetxt('predict_xgb.csv',y_predxg)